import disnake
from disnake.ext import commands
from Database.database import db

class addThreadMessage(commands.Cog):
    def __init__(self, bot):
        self.bot = bot
    channel_ids = [1477014878102356028, 1476962126684749965]
    auto_thread_emojis = [1477235023970042028, 1477235025723392102]

    @commands.Cog.listener()
    async def on_message(self, message):
        if message.author.bot: return
        
        # Канал идей
        if message.channel.id == self.channel_ids[0]:
            thread = await self.createThread(message, f"Публикация {message.author.display_name}", 1440, self.auto_thread_emojis)
            await db.execute(
                """
                INSERT OR REPLACE INTO threads (thread_id, owner_id, message_id, channel_id)
                VALUES (?, ?, ?, ?)
                """,
                (thread.id, message.author.id, message.id, message.channel.id)
            )
            await db.commit()
        
        # Канал новостей
        if message.channel.id == self.channel_ids[1]:
            await self.createThread(message, f"{message.content[-5:]} by {message.author.display_name}", 10080, self.auto_thread_emojis)

    async def createThread(self, message, thread_name: str, archive_duration: int, emoji_list: list) -> disnake.Thread:
        author_message = await message.channel.fetch_message(message.id)
        thread = await author_message.create_thread(
            name=thread_name,
            auto_archive_duration=archive_duration
        )
        for emoji in emoji_list:
            await author_message.add_reaction(self.bot.get_emoji(emoji))
        return thread

def setup(bot):
    bot.add_cog(addThreadMessage(bot))

# # :13201suporte: Список изменений
# - Всех ` приветствую `, на связи @mexaa_. Представляю изменения от ` 01.03.2026 `

#  ` 1 ` Добавлены **autoThreadEvents**, теперь ваши предложения автоматически продвигаются в #📬〡предложения. При отправке поста в данный канал - бот автоматически создаст ветку и добавит нужные реакции.
# ` 2 ` Для канала #📬〡предложения добавлена команда ` /remove_thread `, чтобы вы могли удалять свои ветки по собственной нужде.
# ` 3 ` Удален вид капчи со ` степенями `.
# ` 4 ` Небольшой рефактор и оптимизация кода.
# ` 5 ` Добавлена навигация через ` /menu `, в будущем будет удобное select-меню.
# ` 6 ` Добавлены сообщения для новичков, чтобы координировать их в случае, если: ` они впервые напишут в чаты `, такие как: #💬〡общий, #☕〡оффтоп, #📬〡предложения
# ` 7 ` При заходе на сервер - новые участники автоматически попадают в базу данных


# # :python: Что в будущем?
# - Интересные фишки, в том числе UI взаимодействие с пользователем
# - Доработка системы оповещения новичков в #👋〡новые
# - Доработка навигации ` /menu `
# - Доработка системы ` веток `

# > Как вы поняли, в прямом смысле этого слова: сервер содержится на одном-самописном боте. На этом останавливаться не планирую, буду добавлять все больше и больше разных функций. Со временем сервер станет живее и интереснее со стороны взаимодействия

# 0.1.0